app/views/rooms/_review.html.erb

SELECT AVG("reviews"."points") AS avg_id FROM "reviews"  WHERE "reviews"."room_id" = ?  [["room_id", 2]]
---
  <% else %>
  <%= t '.stats', :average => room.stars,
        :max => room.review_points.max,
        :count => room.total_reviews %>