app/views/rooms/index.html.erb

SELECT "rooms".* FROM "rooms"   ORDER BY "rooms"."created_at" DESC
---

<%= render :partial => 'room', :object => current_user.rooms.first %>