app/controllers/rooms_controller.rb

  def index
    @search_query = params[:q]

    rooms = Room.search(@search_query).
      most_recent.
      page(params[:page]).
      per(PER_PAGE)
---
SELECT  "rooms".* FROM "rooms"   ORDER BY "rooms"."created_at" DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "rooms"

  def show
    room_model = Room.friendly.find(params[:id])
---
SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @room = current_user.rooms.find(params[:id])
---
SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."user_id" = ? AND "rooms"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]

  def create
    @room = current_user.rooms.build(room_params)

    if @room.save
---
INSERT INTO "rooms" ("created_at", "description", "location", "slug", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @room = current_user.rooms.find(params[:id])

    if @room.update_attributes(room_params)
---
SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."user_id" = ? AND "rooms"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
UPDATE "rooms" SET "slug" = ?, "updated_at" = ? WHERE "rooms"."id" = 1  [["slug", "fazenda"], ["updated_at", "2016-03-26 02:24:32.292339"]]

  def destroy
    @room = current_user.rooms.find(params[:id])
    @room.destroy
---
SELECT  "rooms".* FROM "rooms"  WHERE "rooms"."user_id" = ? AND "rooms"."id" = ? LIMIT 1  [["user_id", 2], ["id", 3]]
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 3]]