app/controllers/users_controller.rb

INSERT INTO "users" ("bio", "confirmation_token", "created_at", "email", "full_name", "location", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "bio" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["bio", "Olá, quero viajar no mundo todo e me hospedar pela colcho.net."], ["updated_at", "2016-03-11 20:43:44.201802"]]
---
    def update
      @user = User.find(params[:id])
      if @user.update_attributes(user_params)